
public class Ep_Do_WhileLoop 
{
    public static void main(String[] args) 
    {
        int count = 0;

        do
        {
            String name ="";

            System.out.println(count);
            count++;

            if(count > 5)
            break;

        }
        while(count < 5); 
    
        //! For ใช้ในกรณีรู้จำนวนรอบที่ชัดเจน
        //! While ใช้ในกรณีที่ไม่รู้จักรอบที่ชัดเจน
        //! Do While ใช้ในกรณีที่อยากให่ลองทำก่อน 1 รอบ
        //! แล้วทำซ้ำไปเรื่อยๆ ทราบเท่าที่เงื่อนไขเป็นจริง 

        //! Break = ถ้าโปรแกรม พบคำสั่งนี้จะหลุดออกจากการทำงานในลูปทันที เพื่อ ไปทำคำสั่งอื่นที่่อยู่นอกลูป
        //! Continue = คำสั่งนี้จะทำให้หยุดการทำงานแล้วย้อนกลับไปเริ่มต้นการทำงานที่ต้นลูปใหม่

    }    
}
